select  *
from clnpspfm  CP, -- Таблица исполнения должностей 
     CLNPSDEP  D, -- Таблица Штатные должности(!!!!!)
     CLNPOSTS  M, -- Таблица Должности(!!!!!)
     COMPANIES C,  -- Организации
     CLNPERSONS CL, -- Сотрудники (!!!!!)
     AGNLIST A -- Контрагенты
where CP.PSDEPRN = D.RN
  and D.POSTRN  = M.RN
  and D.COMPANY = C.RN
  and CL.PERS_AGENT=A.RN
  and CP.PERSRN=CL.RN
  and CP.BEGENG <= sysdate
  and (CP.ENDENG >= sysdate or CP.ENDENG is null)
    and CP.COMPANY not in (31924794 -- БюроСМЭ  
                      ,31924466--БюроМедСт
                      ,5286468198--ГВВN2_OLD
                      ,7256915064  --ГКБN50_BACK
                      ,336765558  --ГКБN50
                      ,195210881  --ГКБN67_OLD
                      ,31925452  --ГУ_УКРиС
                      ,473421431  --ГрПкаN107
                      ,195212820  --ГрПкаN11
                      ,183391893  --ГрПкаN12
                      ,176004505  --ГрПкаN166
                      ,189935856  --ГрПкаN201
                      ,166439675  --ГрПкаN214
                      ,195213508  --ГрПкаN22
                      ,168268588  --ГрПкаN52
                      ,195221845 -- ГрПкаN8
                      ,4694916625  --ДБронСN12_ЮВАО
                      ,4694929580  --ДБронСN15_ЮЗАО
                      ,4694919226  --ДБронСN19_ЮВАО
                      ,4694876076  --ДБрхлСN29_СВАО
                      ,1559795830  --ДГКБN1_М (тестовая)
                      ,347997673  --ДГПкаN12
                      ,434024473  --ДГПкаN129
                      ,347998687  --ДГПкаN145
                      ,4694839080  --ДГПкаN30_ЗАО
                      ,4694895436  --ДГПкаN32_ЦАО
                      ,193838969  --ДГПкаN38
                      ,1198781904  --ДГПкаN39
                      ,195214678  --ДГПкаN42
                      ,195229618 -- ДГПкаN52
                      ,746721938 -- ДГПкаN81
                      ,347998011  --ДГПкаN91
                      ,347998349  --ДГПкаN98
                      ,1444638  --ДЗМ
                      ,4694826260  --ДНфрCN9_ВАО
                      ,280984055  --ДСN8
                      ,4694905822  --ДСанN18_ЮАО
                      ,4694906966 --ДСанN56_ЮАО
                      ,3306014051  --ДСтПкаN44
                      ,200496292  --ДТубСN64
                      ,4694899541 --ДетСанN27_ЦАО
                      ,4694889075  --ДетСанN42_СЗАО
                      ,4694900761  --ДетСанN45_ЦАО
                      ,4694902067  --ДетСанN47_ЦАО
                      ,1465040954  --ДтБрлСN68
                      ,4990375385  --ДтБрхСN23_ЮВАО
                      ,4694873510  --ДтНефСнN6_САО
                      ,4694842312  --ЗАО_ДИР_ЗАО
                      ,31926488  --ИАЦ_ДЗМ
                      ,195213174  --КДПкаN121
                      ,164688571  --КарДисN2
                      ,165200467  --МГНПЦТуб
                      ,31928228  --МедКолN1
                      ,31929212  --МедКолN2
                      ,31929540  --МедКолN3
                      ,44127791  --МедКолN4
                      ,44128137  --МедКолN5
                      ,31930196  --МедКолN6
                      ,44128490  --МедКолN7
                      ,44128818  --МедКолN8
                      ,44129170  --МедКолБТ
                      ,44129831  --МедКолКЦ
                      ,59479970  --Медпроект
                      ,31932237  --НПЦЭкстМд
                      ,70596745  --Обучение
                      ,410753202  --Общая
                      ,4694878092  --СВАО_ДИР_СВАО
                      ,1862316535  --СФК_ДЗМ
                      ,31931909 -- ССНМП
                      ,229813242  --СтмПкаN12
                      ,3276773994  --СтмПкаN2
                      ,2598192087  --СтмПкаN24
                      ,183397525  --СтмПкаN32
                      ,3184560142  --СтмПкаN48
                      ,4990370063  --СтмПкаN55_СЗАО
                      ,1497078767  --СтмПкаN62
                      ,3306016308  --СтмПкаN64
                      ,208870413  --СтмПкаN9
                      ,31930524  --УчСестМил
                      ,4694896513  --ЦАО_ДИР_ЦАО
                      ,5286534007  --ЦМСР_ДЦП
                      ,31927244  --ЦРезерв
                      ,31926916  --ЦСертККВ
                      ,31928556  --Центр МИ (не активна)
                      ,4990358272  --ЦпаллМед
                      ,1090574806  --ЭндокрДп
                      ,40455  --Эталон
                      ,1446773  --старая_ВАО
                      ,1447081  --старая_ЗАО
                      ,1447389  --старая_САО
                      ,1447697  --старая_СВАО
                      ,1448005  --старая_СЗАО
                      ,1448621  --старая_ЮАО
                      ,1448929  --старая_ЮВАО
                      ,1449237  --старая_ЮЗАО
                      ,1448313)  --супп_ДГКБN9_С)
                    /*,5286267692 --ГБМ (перенос в апреле)
                      ,2120177615 --ТГБ (перенос в апреле)*/