select  *
from clnpspfm	 CP, -- Таблица исполнения должностей 
     CLNPSDEP  D, -- Таблица Штатные должности(!!!!!)
     CLNPOSTS  M, -- Таблица Должности(!!!!!)
     COMPANIES C,  -- Организации
     CLNPERSONS CL, -- Сотрудники (!!!!!)
     AGNLIST A -- Контрагенты
where CP.PSDEPRN = D.RN
  and D.POSTRN  = M.RN
  and D.COMPANY = C.RN
  and CL.PERS_AGENT=A.RN
  and CP.PERSRN=CL.RN
  and CP.BEGENG <= sysdate
  and (CP.ENDENG >= sysdate or CP.ENDENG is null)
  and CP.COMPANY not in (  40455--Эталон
                      ,1445233  --старая_ЗелАО
                      ,1446773  --старая_ВАО
                      ,1447081  --старая_ЗАО
                      ,1447389  --старая_САО
                      ,1447697  --старая_СВАО
                      ,1448005  --старая_СЗАО
                      ,1448313  --старая_ЦАО
                      ,1448621  --старая_ЮАО
                      ,1448929  --старая_ЮВАО
                      ,1449237  --старая_ЮЗАО
                      ,13468535  --УДП
                      ,31925780  --ДтБрхСN23 не исп
                      ,70596745 -- Обучение
                      ,195210508  --ГКБN52 (тестовая)
                      ,195210881  --ГКБN67 (тестовая)
                      ,229234795  --не исп ЦПСиРN2 не исп
                      ,238751916  --НЕисп_ГрПкаN35_перенос
                      ,238752261  --НЕисп_ГрПкаN208_перенос
                      ,334915463  --ВФД27_перенос
                      ,336765558  --ГКБN50(тестовая)
                      ,372218764  --НЕисп_ГрПкаN204_перенос
                      ,410753202  --Общая
                      ,591175346  --ГКБN57(тестовая)
                      ,591176120  --ГКБN70 (тестовая)
                      ,810163799  --не исп ДСтПкаN52
                      ,811148439  --ДСтПкаN21 не исп
                      ,811576639 -- ДтНефСнN6 не исп
                      ,1071941064 -- ДГПкаN143 не исп
                      ,1113424527  --ГКБN12 (тестовая)
                      ,1239549445  --ДСанN18 не исп
                      ,1359251688  --Обучение_ТНАО
                      ,1359395354  --Обучение_ВАО
                      ,1359407352  --Обучение_ЗАО
                      ,1359407891  --Обучение_САО
                      ,1359409993 --Обучение_СВАО
                      ,1359417824  --Обучение_СЗАО
                      ,1359418380  --Обучение_ЦАО
                      ,1359418896 --N2
                      ,5286219030  --супп_ХосписN3
                      ,5286226774  --супп_ЩГБ
                      ,5286233450  --супп_ВорБолДЗМ
                      ,5286240918  --супп_БцаКУЗ
                      ,5286247978  --супп_ГорБцаN17
                      ,5286254859  --супп_ГорБцаN3
                      ,5286261093  --супп_ГорБцаN56
                      ,5286267692  --супп_ГорБцаМос
                      ,5286275414  --супп_ГКБN13
                      ,5286281684  --супп_ГКБN24
                      ,5286288886  --супп_ГКБN31
                      ,5286297068  --супп_ГКБN4
                      ,5286306366  --супп_ГКБN40
                      ,5286314422  --супп_ГКБN5
                      ,5286322529  --супп_ГКБN51
                      ,5286330446  --супп_ГКБN61
                      ,5286338233  --супп_ГКБN64
                      ,5286346724  --супп_ГКБN68
                      ,5286354734  --супп_ГКБN7
                      ,5286363334  --супп_ГКБN79
                      ,5286370454  --супп_ДГКБ
                      ,5286378503  --супп_ГКБСВ
                      ,5286387193  --супп_ГПсихБцаN13
                      ,5286395120  --Обучение_ЮАО
                      ,1359420385  --Обучение_ЮВАО
                      ,1359429625  --Обучение_ЮЗАО
                      ,1359430859  --Обучение_ЗелАО
                      ,1473531420 -- СпДРебN5 не исп
                      ,1488556226  --ДГПкаN94 (тестовая)
                      ,1528993099  --ДГПкаN140 (тестовая)
                      ,1559795830  --ДГКБN1_М (тестовая)
                      ,1893362385  --ГКБN71 (тестовая)
                      ,1939200776  --ХосписN8 не исп
                      ,2194070991  --не исп ДГПкаN130_del
                      ,4694824172  --ВАО_ДИР_ВАО
                      ,4694842312  --ЗАО_ДИР_ЗАО
                      ,4694851972  --ЗелАО_ДИР_ЗЕЛАО
                      ,4694865114  --САО_ДИР_САО
                      ,4694878092  --СВАО_ДИР_СВАО
                      ,4694882217  --СЗАО_ДИР_СЗАО
                      ,4694896513  --ЦАО_ДИР_ЦАО
                      ,4694903067  --ЮАО_ДИР_ЮАО
                      ,4694924140  --ЮВАО_ДИР_ЮВАО
                      ,4694931710  --ЮЗАО_ДИР_ЮЗАО
                      ,4694933789  --не исп ЮЗАО_ДСтПкаN44 НЕ исп
                      ,5286211205  --супп_Хоспис
                      ,5286403565  --супп_ПБN3_Гил
                      ,5286411804  --супп_ПКБN1
                      ,5286420169  --супп_ГКПсихБцаN15
                      ,5286428677  --супп_ПсихБцаN4
                      ,5286437429  --супп_ДГПкаN58
                      ,5286445035  --супп_ГКБN6
                      ,5286452321  --супп_ИКБN2
                      ,5286461353  --супп_ГВВN1
                      ,5286468198  --супп_ГВВN2
                      ,5286476476  --супп_ГВВN3
                      ,5286485872  --супп_ЧЛГвв
                      ,5286493476  --супп_ОДN1
                      ,5286501851  --супп_ПНДN22_ЗелАО (дубль)
                      ,5286510557  --супп_ХосписN5
                      ,5286518265  --супп_НПЦИКар
                      ,5286526129  --супп_НПЦ_МедПом
                      ,5286534007  --супп_Центр МИСР
                      ,5286542476  --супп_НППЦ
                      ,5286551016  --супп_НПЦПЗдет
                      ,5286559199  --супп_ГрПкаN219
                      ,5420739164  --СВМР_ТЕСТ 
                    ) 
